# ColumnJoinNonhitFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnFailures..::..ColumnJoinNonhitFailure Property
BuiltInFailures..::..ColumnFailures Class See Also
---
The highlighted column can't maintain attachment to the target. It will be treated as unattached until it can intersect.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ColumnJoinNonhitFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnJoinNonhitFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ColumnJoinNonhitFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnFailures Class
Autodesk.Revit.DB Namespace